{
  "log": [
    {
      "version": "3.0.24",
      "date": "2020-10-04",
      "product": "Infraxys",
      "changes": [
        {
          "type": "Changed",
          "title": "Minor bugfixes and improvements",
          "description": ""
        }
      ]
    },
    {
      "version": "3.0.21",
      "date": "2020-09-27",
      "product": "Infraxys Developer",
      "changes": [
        {
          "type": "Changed",
          "title": "[ATTENTION] Moved from HTTPS to HTTP. You need to clear your browsers cache to avoid continuous reload.",
          "description": "Infraxys Developer will run on http://localhost:<PORT> instead of https://localhost:<PORT> after this upgrade."
        }
      ]
    },
    {
      "version": "2.0.600",
      "date": "2020-09-20",
      "product": "Infraxys",
      "changes": [
        {
          "type": "Added",
          "title": "Add React apps, JavaScript, charts, ... or include html pages in JSON forms.",
          "description": "Copy any HTML, CSS, JavaScript, JSX, ... to the project cache and reference them in the JsonForm specification. Add an iframe that references an external site or create full-blown, dynamic D3.js graph views. A walkthrough will be added to Infraxys-by-example soon."
        },
        {
          "type": "Added",
          "title": "You can now export JsonTables to csv files",
          "description": "An export-button is added to JsonTable components if new attribute 'enableExport' is specified with value 'true'."
        }
      ]
    },
    {
      "version": "2.0.587",
      "date": "2020-09-13",
      "product": "Infraxys",
      "changes": [
        {
          "type": "Added",
          "title": "JsonTables can now have columns with hyperlinks",
          "description": "Add attributes 'columnType' and 'linkField' to the column-definition of a table to make it display the values for the property with a link to the value of the linkField-attribute."
        }
      ]
    },
    {
      "version": "2.0.586",
      "date": "2020-09-12",
      "product": "Infraxys",
      "changes": [
        {
          "type": "Added",
          "title": "Added dialog types and options for Json Forms",
          "description": "Pass custom button lists (from Bash, Python, ...) through the FEEDBACK-process."
        }
      ]
    },
    {
      "version": "2.0.582",
      "date": "2020-09-08",
      "product": "Infraxys",
      "changes": [
        {
          "type": "Added",
          "title": "Add quick runners - actions without dependencies",
          "description": "When using quick runners, which is a new checkbox in the packet file view, Infraxys will launch the action directly without preparing dependencies. Only the current environment's files, arguments,json, has_grant and current_user.json are available. No modules nor variables."
        }
      ]
    },
    {
      "version": "2.0.581",
      "date": "2020-09-06",
      "product": "Infraxys",
      "changes": [
        {
          "type": "Added",
          "title": "Specify JSON files for tables and dropdowns in custom forms and get filter results back through files.",
          "description": "When adding a datapart for a JSON table or dropdown, you can now specify the path to a cache- or module-file.<br/>To get the contents of a table using Python, just call the store_selected_items function on the JsonForm.<br/>This is useful when the user can filter a table and perform actions against the result.<br/>Example request: <br/>```{ \"requestType\": \"UI\",\n            \"subType\": \"STORE SELECTED ITEMS\",\n            \"objectId\": object_id}```"
        }
      ]
    },
    {
      "version": "2.0.568",
      "date": "2020-08-30",
      "product": "Infraxys Developer",
      "changes": [
        {
          "type": "Added",
          "title": "Mount host directories in action runner containers.",
          "description": "Host directories can be mounted into action containers using the 'Host mounts'-tab in the Settings-view. Use this to share files betwwen the host and all actions, like SSH configurations. Generate SSH configs for AWS VPCs, for example, and automatically make them available to the host."
        }
      ]
    },
    {
      "version": "2.0.563",
      "date": "2020-08-23",
      "product": "Infraxys",
      "changes": [
        {
          "type": "Changed",
          "title": "Share project cache with all child projects and the global-cache is removed.",
          "description": "Specify in the project details if the project cache should be made available (readonly) to all child projects.<br/>Enter an alias for the cache name to use for the directory. The cache will be available at /cache/project/<cache alias or at /cache/project/<project guid> if no alias is specified.<br/>This cache-sharing makes the global cache obsolete so it has been removed in this release."
        },
        {
          "type": "Added",
          "title": "Copy and move environments between branches.",
          "description": "It's now possible to copy and move environments with their containers to other branches.<br/>Be careful though, because another Infraxys environment that uses the (re)moved environment will become invalid if they have the environment attached to a project."
        }
      ]
    },
    {
      "version": "2.0.553",
      "date": "2020-08-16",
      "product": "Infraxys",
      "changes": [
        {
          "type": "Added",
          "title": "Git dialog shows remote changes",
          "description": "Remote changes are inspected and displayed when a user selects a branch in the Git dialog. This helps to avoid merge conflicts."
        },
        {
          "type": "Added",
          "title": "Project selection shows all containers in all child environments",
          "description": "When a user selects a project in the project tree, then the container-table will be loaded with all containers that below to an environment of the project or any of its children."
        }
      ]
    },
    {
      "version": "2.0.526",
      "date": "2020-08-08",
      "product": "Infraxys",
      "changes": [
        {
          "type": "Changed",
          "title": "Git pulls with local changes",
          "description": "When a branch is pulled, either directly or because it's a dependency, then the pull won't be done if there are local changes in the branch."
        },
        {
          "type": "Added",
          "title": "Auto-run workflows optional on pull",
          "description": "Workflows that are configured to run automatically after updates are done to its repository will always run when triggered through a webhook.<br/>When pulling changes manually, there's a new menu through which the workflow execution can be avoided."
        }
      ]
    },
    {
      "version": "2.0.519",
      "date": "2020-08-02",
      "product": "Infraxys",
      "changes": [
        {
          "type": "Added",
          "title": "Multiple inheritance for packets",
          "description": "Packets can extend multiple other packets and many levels deep.<br/>Attributes and files are inherited.<br/>Extend the Terraform runner packet and inherit the plan and apply actions, for example. See [Packet](https://infraxys.io/concepts/resource-types/packet/) for more information."
        }
      ]
    },
    {
      "date": "2020-07-26",
      "product": "Terraform",
      "changes": [
        {
          "type": "Added",
          "title": "Confirmers; require approval/confirmation to apply a plan.",
          "description": "Confirmers are non-default ways to require some kind of confirmation before a Terraform plan can be applied. The SES-email confirmer, for example, sends an email to one or more email-address contain the Terraform plan for review and a button to directly apply the plan."
        }
      ]
    },
    {
      "version": "2.0.514",
      "date": "2020-07-26",
      "product": "Infraxys",
      "changes": [
        {
          "type": "Added",
          "title": "New Python class generator",
          "description": "Attribute 'Class' is added to the packet-view.<br/>A Python class under the module-directory 'generated' will be created automatically.<br/>This class contains variables for the attributes and details about the packet.<br/>Use this, for example, to easily invoke the Infraxys REST-API to retrieve and create instances."
        },
        {
          "type": "Added",
          "title": "5 cache levels",
          "description": "Cache binaries, Terraform plans and provisioners, data, ... and re-use it in actions of the same instance, container, environment or project.<br/>A global cache is also available which is readable by any action, but can only be written to from actions in environments that are linked directly under the root-project.<br/>See [Cache concept](https://infraxys.io/topics/caching/) for more details."
        }
      ]
    }
  ],
  "title": "Infraxys changelog",
  "description": "This page contains important changes done to Infraxys and its supported modules.",
  "products": [
    {
      "name": "Infraxys",
      "url": "https://infraxys.io"
    },
    {
      "name": "Infraxys Developer",
      "url": "https://infraxys.io"
    },
    {
      "name": "Terraform",
      "url": "https://github.com/infraxys-modules/terraform"
    }
  ]
}